[
    {
        "page": 1,
        "content": [
            "Machine Learning Approach to Phishing Detection",
            "Arvind Rekha Sura Jyoti Kini Kishan Athrey",
            "Department of Department of Department of",
            "Computer Science Computer Science Computer Science",
            "University of Central Florida University of Central Florida University of Central Florida",
            "Orlando, Florida Orlando, Florida Orlando, Florida",
            "Email: arvindrs.gb@knights.ucf.edu Email: jyoti.kini@knights.ucf.edu Email: kishan.athrey@knights.ucf.edu",
            "Abstract—The goal of our project is to implement a machine Several solutions have been proposed to combat phishing",
            "learning solution to the problem of detecting phishing and ranging from educating the web users to stronger phishing",
            "malicious web links. The end result of our project will be a detection techniques. The conventional approach to phishing",
            "softwareproductwhichusesmachinelearningalgorithmtodetect detection has not been successful because of the diverse and",
            "malicious URLs. Phishing is the technique of extracting user",
            "evolving nature of phishing attacks. For instance, in January",
            "credentials and sensitive data from users by masquerading as",
            "2007, the total number of unique phishing reports submitted",
            "a genuine website. In phishing, the user is provided with a",
            "to the Anti-Phishing Working Group (APWG) was 29,930.",
            "mirror website which is identical to the legitimate one but with",
            "Compared to the previous peak in June 2006, the number",
            "malicious code to extract and send user credentials to phishers.",
            "Phishing attacks can lead to huge financial losses for customers of submitted reports increased by 5% [3]. This happened",
            "of banking and financial services. The traditional approach to despite taking preventive measure to thwart phishing. Upon",
            "phishing detection has been to either to use a blacklist of investigation, it was found that each phishing attack was",
            "known phishing links or heuristically evaluate the attributes in different from the other one. Thus it becomes imperative to",
            "a suspected phishing page to detect the presence of malicious find a way to adapt our phishing detection techniques as and",
            "codes. The heuristic function relies on trial and error to define when new attack patterns are uncovered.",
            "thethresholdwhichisusedtoclassifymaliciouslinksfrombenign",
            "ones. The drawback to this approach is poor accuracy and low",
            "adaptability to new phishing links. We plan to use machine",
            "Machine learning algorithms, which make a system learn",
            "learning to overcome these drawbacks by implementing some",
            "newpatternsfromdata,areanidealsolutiontotheproblemof",
            "classificationalgorithmsandcomparingtheperformanceofthese",
            "phishing detection. Although there have been many papers in",
            "algorithmsonourdataset.WewilltestalgorithmssuchasLogistic",
            "Regression, SVM, Decision Trees and Neural Networks on a recent years which have attempted to detect phishing attacks",
            "datasetofphishinglinksfromUCIMachineLearningrepository using machine learning, we intend to go one first step further",
            "and pick the best model to develop a browser plugin, which can and build a software tool which can be easily deployed in",
            "be published as a chrome extension. end user systems to detect phishing attacks.",
            "Keywords—Phishing Detection(PD), Chrome Extension(CE),",
            "Random Forest(RF), Support Vector Machine(SVM), Neural Net-",
            "For our project, we will experiment with three machine",
            "works(NN)",
            "learning algorithms on a dataset of features that represent",
            "attributes commonly associated with phishing pages, choose",
            "the best model based on their performance and build a web",
            "I. INTRODUCTION",
            "browser plugin which will eventually be deployed to end",
            "Financialservicessuchasbankingarenoweasilyavailable users. The project report has been designed as follows; the",
            "over the Internet making the lives of people easy. Thus it is Previous Work section describes the traditional approaches",
            "very important that the security and safety of such services to phishing detection and some of the machine learning ap-",
            "are maintained. One of the biggest threats to web security proaches attempted in recent years, the Proposed Approach",
            "is Phishing. Phishing is the technique of extracting user section describes in detail our approach and what will be the",
            "credentials by masquerading as a genuine website or service end product of our project, the Dataset section describes the",
            "over the web. There are various types of phishing attacks dataset that we are using for our project along with a list of",
            "such as Spear phishing, which targets specific individuals features which will be used in our project, Machine Learning",
            "or companies, Clone phishing is a type of phishing where Algorithmssectionexplainsthedifferentalgorithmswhichwe",
            "an original mail with an attachment or link is copied into havetestedwithourdatasetwiththeirdescriptions,theChrome",
            "a new mail with a different (possibly malicious) attachment PluginImplementationsectiondescribesthearchitectureofour",
            "or link, Whaling, etc. Phishing can lead to huge financial phishingdetectionsystemandgivesdescriptionsofthevarious",
            "losses. For example, the Microsoft Consumer Safer Index software modules in the system, the Results section gives the",
            "(MCSI) report for 2014 has estimated the annual worldwide results of our experiments with the algorithms with graphs",
            "impact of Phishing and other identity thefts to be nearly USD plotting a comparison between the three algorithms on factors",
            "5 Billion [1]. Similarly, the IRS has warned of a surge in such as accuracy, sensitivity and false positive rate, and the",
            "phishingattackswithover400%increaseinreportedcases[2]. Conclusion section summarizes our project with an outlook",
            "on future enhancements."
        ]
    },
    {
        "page": 2,
        "content": [
            "II. RELATEDWORK extension with it. A Chrome extension will enable us to",
            "deploy the learned model easily on the Chrome Web Store,",
            "There are basically two approaches to phishing detection",
            "from where anyone can download and use our product for",
            "which are the blacklist approach and the heuristic evaluation",
            "phishing detection.",
            "ofthesourcecodetocheckforattributescommonlyassociated",
            "with phishing sites. The blacklist approach involves maintain-",
            "ing a publicly available list of reported phishing sites so that Inordertosuccessfullyimplementthisproject,weneedto",
            "the number of victims of any new phishing site is kept very considerthreeconstraintswhenchoosingthemachinelearning",
            "low. The main drawback with this approach is that a new algorithm for our product. First, the accuracy of the trained",
            "phishing site has to be detected first before it can be reported. model should be high, as a product being used by end users",
            "As phishers become more sophisticated with their phishing in the real world should not give wrong results. Second,",
            "attacks, it becomes more difficult to detect those attacks. The the algorithm which is being implemented should be able to",
            "other approach to phishing detection is to analyze the source make classifications in real-time; i.e. have very low execution",
            "code of a suspected phishing web page and identify attributes time and also use less computational resources. Third, false",
            "commonly associated with phishing sites. This approach is positivesandfalsenegativesareimportantconsiderationswhen",
            "better than the blacklist method as we can potentially detect choosing a machine learning algorithm for the problem of",
            "new phishing attacks within minutes of their launch. But as phishing detection. This is because a user should not be",
            "pointed out before, because of the diverse nature of phishing wrongly led to believe that a phishing website is legitimate.",
            "attacksithasbecomeincreasinglydifficulttodetectnewattack Thus,weshouldlookatthesethreeconstraintswhenselecting",
            "patterns.Traditionally,theheuristicevaluationofthewebpage our phishing detection classifier.",
            "sourcecodeinvolvedmaintainingacountofidentifiedphishing",
            "attributes and setting threshold for that count using trial and",
            "IV. DATASET",
            "error, above which the page was considered a phishing site.",
            "As it is obvious, the hardcoding of such thresholds inherently To evaluate our machine learning techniques, we have",
            "make it difficult for the phishing detection system to adapt used the ‘Phishing Websites Dataset’ from UCI Machine",
            "to new attack patterns. Thus, we use machine learning to train learning repository. It consists of 11,055 URLs (instances)",
            "thesystemtodetectphishingattacksandrelearnfromthedata with 6157 phishing instances and 4898 legitimate instances.",
            "whenever a new phishing attack pattern is uncovered. There Each instance contains 30 features. Each feature is associated",
            "are sufficient literatures in recent years employing machine with a rule. If the rule satisfies, it is termed as phishing. If",
            "learning algorithms to the problem of phishing detection. In the rule doesn’t satisfy then it is termed as legitimate. The",
            "[3], for example, the work done by Chandrasekaran et al. features take three discrete values. ‘1’ if the rule is satisfied,",
            "describesatechniquetoclassifyphishingemailsbasedontheir ‘0’ if the rule is partially satisfied, ‘-1’ if the rule is not",
            "structural properties such as style markers and the structure satisfied.",
            "of the subject line, etc. They used Simulated Annealing for",
            "feature selection and Information Gain to rank the features",
            "based on their relevance on a dataset of 100 phishing emails The training dataset for our project is taken from",
            "and 100 legitimate emails. Later they used Support Vector the \"Phishing Websites Data Set\" of the UCI Machine",
            "Machines to classify the emails as phishing and legitimate learning repository. This dataset was compiled by [see",
            "based on their chosen features, getting an accuracy of 95%. acknowledgements]. The dataset consists of 11,055 entries",
            "The paper [3] also describes the approach taken by Fette et with 6157 phishing instances and 4898 legitimate instances.",
            "al., where they compared commonly used learning algorithms Each instance consists of 30 features comprising of various",
            "on a dataset of detected phishing emails composed of 860 attributes typically associated with phishing or suspicious",
            "phishingemailsand6950legitimateemails.Theyhandpicked web pages such as presence of IP address in the URL domain",
            "tenfeaturesandusedRandomForestsalgorithmonthedataset or presence of JavaScript code to modify the web browser",
            "which provided an accuracy of 96% with a false positive rate addressbarinformation.Eachfeatureisassociatedwitharule.",
            "of 0.1%. If the rule is satisfied, we take it as an indicator of phishing",
            "and legitimate otherwise. The dataset has been normalized to",
            "III. PROPOSEDAPPROACH contain only discrete values. Each feature of each instance",
            "will contain ’1’ if the rule associated with that feature is",
            "We propose to use machine learning to overcome the",
            "satisfied, ’0’ if partially satisfied and ’-1’ if unsatisfied.",
            "drawbacks associated with the traditional approaches to",
            "phishing detection. The problem of phishing detection is",
            "an ideal candidate for the application of machine learning The features represented by the training dataset can be",
            "solutionsbecauseoftheeasyavailabilityofsufficientamounts classified into four categories;",
            "of data on phishing attack patterns. The basic idea is to use i) Address Bar based features",
            "machine learning algorithms on available dataset of phishing ii) Abnormal based features",
            "pages to generate a model which can be used to make iii) HTML and JavaScript based features",
            "classifications in real time if a given web page is a phishing iv) Domain based features",
            "page or a legitimate webpage. We intend to productionize the",
            "learned model into a software tool which can be deployed",
            "A. Address bar based features",
            "easily to end users for combating phishing attempts. For this",
            "purpose we have chosen to implement a machine learning 1.1 Using IP address: If the domain of the URL of",
            "algorithm from scratch using JavaScript and build a Chrome the suspected web page contains IP address, then we take"
        ]
    },
    {
        "page": 3,
        "content": [
            "it as a phishing page. eg: http:125.98.3.123fake.html or C. HTML and Javascript based features",
            "http:x58.0xCC.0xCA.0x622paypal.caindex.html",
            "3.1 Status bar customization: Phishers can modify the",
            "1.2 Long URL to hide suspicious part: It has been a status bar using JavaScript to show a legitimate URL. By",
            "commonobservancethatphishingwebpagesusuallyhavelong analyzing the \"onMouseOver\" events in the web page we can",
            "URLs that attempt to hide malicious URL fragments from the determine if such a modification has occurred.",
            "user. We take the assumption that a web page with a long",
            "3.2 Disabling right click option: Phishers can disable the",
            "URL is necessarily a phishing or suspicious site. In the event",
            "rightclickoptiontopreventtheuserfromcheckingthesource",
            "the assertion fails, i.e, for a legitimate web page with valid",
            "codeofthepage.Thisisverifiedbyanalyzingthesourcecode.",
            "long URLs, the absence of other phishing attributes on the",
            "web page will balance the wrong assumption and correctly 3.3 Using pop-up window: Legitimate sites rarely ask for",
            "classify a legitimate web page as non-phishing. userinfoonapop-upwindow,whereasphishingsitesgenerally",
            "use pop-up windows to get user info.",
            "1.3 Use of URL shortening services: A shortened URL",
            "3.4 Iframe redirection: Phishers also use Iframe tags with",
            "hides the real URL behind a redirection hop. A web page that",
            "invisible borders to get user info and redirect to the original",
            "uses a URL shortening service such as TinyURL is highly",
            "site. We analyze the source code to check if Iframe tags are",
            "suspiciousandislikelytobeaphishingattempt.Therefore,we",
            "used.",
            "set the rule that if the URL has been shortened using a URL",
            "shortening service then it is a phishing page and legitimate",
            "otherwise. V. MACHINELEARNINGIMPLEMENTATION",
            "We have trained and tested supervised machine learning",
            "1.4 Use of \"@\" symbol: Needs verification The \"@\"",
            "algorithms on the training dataset. The following algorithms",
            "symbol is a reserved keyword according to Web standards.",
            "were chosen based on their performance on classification",
            "So the presence of \"@\" in a URL is suspicious and the web",
            "problems. The dataset was split into training and test set in",
            "page is taken as phishing and legitimate otherwise.",
            "the ratio 7:3. The results of our experiment are given in the",
            "1.5 Redirection with \"\": The presence of \"//\" in the URL results section.",
            "path indicates the page will be redirected to another page. If",
            "the position of \"//\" in the URL is greater than seven then it is A. Random Forests",
            "a phishing site and legitimate otherwise.",
            "Random forests are classifiers that combine many tree",
            "predictors,whereeachtreedependsonthevaluesofarandom",
            "1.6Addingprefixorsuffixseparatedby\"-\"tothedomain:",
            "vector sampled independently. Furthermore, all trees in the",
            "Phisherstendtoaddaprefixorsuffixtothedomainwith\"-\"to",
            "forest have the same distribution. To construct a tree, we",
            "givetheresemblenceofageniunesite.Eg:www.a-paypal.com",
            "assume that n is the number of training observations and p",
            "1.7 Sub domains and multi sub domains: If a URL has is the number of variables (features) in a training set. To",
            "more than three dots in the domain part then it is considered determine the decision node at a tree we choose k « p as",
            "as a phishing site and legitimate otherwise. the number of variables to be selected. We select a bootstrap",
            "sample from the n observations in the training set and use",
            "the rest of the observations to estimate the error of the tree",
            "B. Abnormal based features in the testing phase. Thus, we randomly choose k variables",
            "as a decision at a certain node in the tree and calculate",
            "2.1 Request URL: A legitimate site usually has external",
            "the best split based on the k variables in the training set.",
            "pageobjectssuchasimages,animations,files,etc.beaccessed",
            "Trees are always grown and never pruned compared to other",
            "by a request URL which shares the same domain as the web",
            "tree algorithms. Random forests can handle large number",
            "page URL. We classify sites which fail this rule as phishing.",
            "of variables in a data set. Also, during the forest building",
            "process they generate an internal unbiased estimate of the",
            "2.2 URL portion of anchor tag: We check if the domain",
            "generalization error. In addition, they can estimate missing",
            "in the URL portion of all anchor tags match the main URL",
            "data well. A major drawback of random forests is the lack of",
            "of the page and if the anchor tag has only URL fragments or",
            "reproducibility,astheprocessofbuildingtheforestisrandom.",
            "JavaScript functions.",
            "Further, interpreting the final model and subsequent results is",
            "2.3 Links in <meta>, <script> and <link> tags: We check difficult, as it contains many independent decisions trees.",
            "if the domain of the links in the <meta>, <script> and <link>",
            "tags matches the domain in the mail URL. B. Artificial Neural Networks",
            "2.4ServerFormHandler(SFH):Whenaformissubmitted, A neural network is structured as a set of interconnected",
            "some valid action must be taken. So if the action handler of a identical units (neurons). The interconnections are used to",
            "form is empty or \"about:blank\" or if the domain of the action send signals from one neuron to the other. In addition, the",
            "URL is different from the domain of the main URL, then it is interconnections have weights to enhance the delivery among",
            "taken as a phishing site. neurons. The neurons are not powerful by themselves, how-",
            "ever, when connected to others they can perform complex",
            "2.5 Submitting Information to Email: If the webpage con- computations. Weights on the interconnections are updated",
            "tains a \"mailto:\" function then it is taken as a phishing site when the network is trained, hence significant interconnection",
            "and legitimate otherwise. playmoreroleduringthetestingphase.Sinceinterconnections"
        ]
    },
    {
        "page": 4,
        "content": [
            "do not loop back or skip other neurons, the network is called Furthermore, the data instances, which exhibit non-linear",
            "feedforward. The power of neural networks comes from the separation, are mapped to higher dimension space and clas-",
            "nonlinearity of the hidden neurons. In consequence, it is sified using hyperplane in the higher dimension. Here, the",
            "significant to introduce nonlinearity in the network to be able kernel-trick plays a vital role in computational cost reduction",
            "to learn complex mappings. The commonly used function in by introducing kernel function as an alternative to computing",
            "neural network research is the sigmoid function. Although higher dimension vectors.",
            "competitive in learning ability, the fitting of neural network",
            "(Z ,y ), i=1,...n, Z =Φ(X ) (12)",
            "models requires some experience, since multiple local minima i i i i",
            "are standard and delicate regularization is required. n n",
            "(cid:88) 1 (cid:88)",
            "Objective(max) q(µ)= µ − µ µ y y ZTZ",
            "i 2 i j i j i j",
            "C. Support Vector Machines i=1 i,j=1",
            "(13)",
            "n",
            "Support Vector Machine (SVM) is a supervised machine (cid:88)",
            "Constraints C >=µ >=0, i=1,...n, µ y =0",
            "learningdiscriminativemodel,whichconformstotheprinciple i i i",
            "ofdrawingseparatinghyper-planewithmaximumsafetyspace, i=1",
            "(14)",
            "called margin, to minimize the risk of flawed predictions. (cid:88)",
            "W∗ = µ∗y X , b∗ =y −XTW∗, j C >µ >0",
            "i i i i i i",
            "For linearly separable data points, Hard-Margin SVM is (15)",
            "modelled on below primal optimization:",
            "Below are some of the most commonly used kernel func-",
            "1 tions:",
            "Objective(min) WTW (1)",
            "2 ||X −X ||2",
            "Gaussian K (X ,X )=e− i j (16)",
            "Constraints y (WTX +b)>=1, i=1,...n (2) g i j σ2",
            "i i",
            "Sigmoid K (X ,X )=tanh(αXTX +θ) (17)",
            "Here, primarily, the hyperplanes, which satisfy the constraints s i j i j",
            "are identified and only for the valid hyperplanes we tend to Polynomial K (X ,X )=(1+XTX )p (18)",
            "maximise the margin. The arithmatic computation involved is p i j i j",
            "simplified using the dual form, which is as follows:",
            "VI. TECHNICALAPPROACHDETAILS",
            "n n",
            "Objective(max) q(µ)= (cid:88) µ − 1 (cid:88) µ µ y y XTX The proposed approach aims at building a browser exten-",
            "i 2 i j i j i j sion powered by state-of-the-art machine learning technique",
            "i=1 i,j=1",
            "(3) for phishing detection. Furthermore, given the flexibility of",
            "n margin and reduced computational complexity offered by",
            "(cid:88)",
            "Constraints µ i >=0, i=1,...n, µ i y i =0 (4) SVM, for classification problem statements, the implementa-",
            "i=1 tion employs SVM trained persistent model to identify the",
            "malicious sites. The extension is packaged to support Chrome",
            "(cid:88)",
            "W∗ = µ∗ i y i X i , b∗ =y i −X i TW∗, j µ i >0 (5) browser in specific, solely by the virtue of its popularity.",
            "Additionally, extensions exhibit minimal web-dependence, as",
            "However, the formulation fails to incorporate the outliers and",
            "it collates multiple files into single file for user to download,",
            "therefore, cannot be used for generalisation.",
            "as one-time activity.",
            "Contradictory to the Hard-Margin SVM, the Soft-Margin",
            "SVM offers flexibility to select the optimal support vectors A. Browser Extension Schematics",
            "usingC.TheprimalojectiveforSoft-MarginSVMisasbelow:",
            "The solution deals with training the model with available",
            "1 (cid:88) n data-set, using SVM discriminative classifier, followed by",
            "Objective(min) 2 WTW +C ξ i (6) passing the persistent model to the extension, which further",
            "i=1 predicts the authenticity of the user accessed websites and",
            "providesalertstonotifythelegitimacyofthebrowsedURLon",
            "Constraints to y (WTX +b)>=1−ξ , i=1,...n",
            "i i i everypageload.ThesolutionintegratesPython-basedtraining",
            "(7)",
            "stage implementation with JavaScript-based testing module.",
            "ξ >=0, i=1,...n (8)",
            "i ThetrainingcomponenthasbeendesignedusingPython,soas",
            "to make optimal utilisation of the available complex numeric",
            "While, the dual problem is represented as:",
            "computationlibraries.Moreover,giventhefactthatthetesting",
            "(cid:88) n 1 (cid:88) n stage is centric to web-content and feature extraction, and has",
            "Objective(max) q(µ)= µ i − 2 µ i µ j y i y j X i TX j minimal heavy computation activities associated; the solution",
            "i=1 i,j=1 does face client-end computation performance lag concerns.",
            "(9)",
            "n During the initial analysis of the project, the team anal-",
            "(cid:88)",
            "Constraints C >=µ i >=0, i=1,...n, µ i y i =0 ysed couple of approaches; and weighing the pros, cons and",
            "i=1 bandwidth of the resources, finalised the persistent model",
            "(10)",
            "passing methodology as the favored methodology. One of",
            "(cid:88)",
            "W∗ = µ∗ i y i X i , b∗ =y i −X i TW∗, j C >µ i >0 the planned approaches aimed at developing Node.js enabled",
            "(11) testing component, where the SVM model is structured as"
        ]
    },
    {
        "page": 5,
        "content": [
            "web-page are loaded from other domains",
            "isScLnkFromDifferentDomain(): Identify if scripts on given",
            "web-page are loaded from other domains",
            "isFormActionInvalid(): Detect invalid/blank form submissions",
            "isMailToAvailable(): Check for anchor tag incorporating",
            "mailto",
            "isStatusBarTampered(): Validate if onmouseover manipulates",
            "the status bar display",
            "isIframePresent(): Identify sites, which exhibit iframes in the",
            "DOM",
            "Theextractedfeatures,further,passedthroughtheSVMmodel",
            "identify hostile web-URLs.",
            "Fig. 1: Proposed phishing detection chrome extension VII. EXPERIMENTALEVALUATION",
            "implementation",
            "Thisprojectcomparestheperformanceofalltheclassifiers",
            "described in section 5 on the phishing dataset. We have",
            "evaluated these algorithms on 3317 test samples using various",
            "scalable Web API for the testing module’s consumption. Bry- performance metrics and this section contains the tabulated",
            "thon server-side architecture, which enables to run python in results with their graphs.",
            "the browser; and Rapydscript client-side architecture, which",
            "supportscompilingpythontojavascript;havebeensomeofthe",
            "TABLE I: Random Forest Confusion Matrix",
            "otheroptionsconsideredduringtheimplementation.However,",
            "due to the computation advancements offered by Python over",
            "Brython/Rapydscript, the solution has been designed with PredictedPhishing PredictedLegitimate",
            "URLs URLs",
            "Python-based training module.",
            "GroundTruthPhishingURLs 1249 162",
            "GroundTruthLegitimateURLs 182 1680",
            "B. Algorithm Details",
            "The Chrome extension complies to the Google norms and,",
            "Table 1 shows the confusion matrix for Random forests.",
            "primarily,consistsofthreemainfiles:manifest.json,content.js,",
            "With 1249 true positives, 182 false positives, 162 false",
            "background.js. The manifest file provides all the meta data",
            "negatives and 1680 true negatives.",
            "informationabouttheextensiontoChromebrowser.Addition-",
            "ally,italsospecifiesallthefilesandotherresourcesassociated",
            "to the extension. The content.js file loads on every page in the",
            "Chrome browser, post the extension deployment. However, it TABLE II: Artificial Neural Network Confusion Matrix",
            "is an unprivileged module, which has direct access only to",
            "the DOM elements and needs supporting files to interact to PredictedPhishing PredictedLegitimate",
            "external APIs and browser user interface manipulation. The URLs URLs",
            "supplementary file background.js aids the content script with GroundTruthPhishingURLs 1205 250",
            "these interactions, which is termed as message passing. GroundTruthLegitimateURLs 170 1692",
            "Multiplefunctionshavebeenimplementedinthecontent.js",
            "Table 2 shows the confusion matrix for Artificial neural",
            "script for web-content and URL feature extraction. Below",
            "network. With 1205 true positives, 170 false positives, 250",
            "are the details used to identify phishing portals: isIPInURL():",
            "false negatives and 1692 true negatives.",
            "Identify presence of IP address in the URL",
            "isLongURL(): Validate if length of the URL is beyond 75",
            "characters",
            "isTinyURL(): Identify URLs smaller than 20 charaters TABLE III: SVM Confusion Matrix",
            "isAlphaNumericURL(): Check for alphanumeric ’@’ in URL",
            "isRedirectingURL(): Verify if ’//’ existing within the URL PredictedPhishing PredictedLegitimate",
            "more than once URLs URLs",
            "isHypenURL(): Check for presence of ’-’ adjacent to domain",
            "GroundTruthPhishingURLs 1293 206",
            "name in URL GroundTruthLegitimateURLs 131 1731",
            "isMultiDomainURL(): Domain name should be confined to",
            "top-level domain, country-code and second-level domain.",
            "isFaviconDomainUnidentical(): Verify if links on given web- TABLE IV: Performance matrix of classifiers",
            "page are loaded from other domains",
            "isIllegalHttpsURL(): Identify presence of multiple ’https’ in",
            "Accuracy(%) Specificity(%) Sensitivity(%)",
            "the URL string",
            "ArtificialNeuralNetwork 87.34 91 83",
            "isImgFromDifferentDomain(): Validate if images on given",
            "RandomForest 89.63 90 86",
            "web-page are loaded from other domains",
            "SVM 89.84 93 89",
            "isAnchorFromDifferentDomain(): Detect if links on given"
        ]
    },
    {
        "page": 6,
        "content": [
            "Fig. 2: Accuracy of classifiers Fig. 4: False positive rate of classifiers",
            "detection is an important problem domain. We have reviewed",
            "some of the traditional approaches to phishing detection;",
            "namely blacklist and heuristic evaluation methods, and their",
            "drawbacks. We have tested three machine learning algorithms",
            "on the ‘Phishing Websites Dataset’ from the UCI Machine",
            "Learning Repository and reviewed their results. We then se-",
            "lected the best algorithm based on it’s performance and built",
            "a Chrome extension for detecting phishing web pages. The",
            "extension allows easy deployment of our phishing detection",
            "model to end users. For future enhancements, we intend to",
            "build the phishing detection system as a scalable web service",
            "which will incorporate online learning so that new phishing",
            "attackpatternscaneasilybelearnedandimprovetheaccuracy",
            "Fig. 3: Sensitivity of classifiers of our models with better feature extraction.",
            "REFERENCES",
            "Table 3 shows the confusion matrix for Support vector",
            "[1] Microsoft, Microsoft Consumer safety report. Available at",
            "machine. With 1293 true positives, 206 false positives, 131",
            "https://news.microsoft.com/en-sg/2014/02/11/microsoft-consumer-",
            "false negatives and 1731 true negatives. safety-index-reveals-impact-of-poor-online-safety-behaviours-in-",
            "singapore/sm.001xdu50tlxsej410r11kqvksu4nz",
            "[2] Internal Revenue Service, IRS E-mail Schemes. Available at",
            "The Figure 2 shows the accuracy of each classifier evalu- https://www.irs.gov/uac/newsroom/consumers-warned-of-new-surge-",
            "ated on 3317 test samples. From the above figure, it can be in-irs-email-schemes-during-2016-tax-season-tax-industry-also-targeted",
            "seen that SVM outperforms all the other algorithms based on [3] Abu-Nimeh,S.,Nappa,D.,Wang,X., Nair,S.(2007),Acomparisonof",
            "accuracy in detection of Phishing URL. Also, Figure 3 shows machinelearningtechniquesforphishingdetection.Proceedingsofthe",
            "the sensitivity of each classifier. Here sensitivity refers to the Anti-phishingWorkingGroups2ndAnnualECrimeResearchersSummit",
            "on-ECrime’07.doi:10.1145/1299015.1299021",
            "classifier’s ability to correctly detect phishing URLs. It can be",
            "[4] E., B., K., T. (2015)., Phishing URL Detection: A Machine Learning",
            "seen that SVM has the highest sensitivity among all the other",
            "and Web Mining-based Approach. International Journal of Computer",
            "classifiers. However, in phishing detection, false positives and",
            "Applications,123(13),46-50.doi:10.5120/ijca2015905665",
            "false negatives are given more consideration when studying",
            "[5] Wang Wei-Hong, L V Yin-Jun, CHEN Hui-Bing, FANG Zhao-Lin., A",
            "the performance (predictive accuracy) of a classifier. That is Static Malicious Javascript Detection Using SVM, In Proceedings of",
            "becausefalsepositivesaremoreexpensivethanfalsenegatives the 2nd International Conference on Computer Science and Electrical",
            "in the real world. Since we do not want to allow users to Engineering(ICCSEE2013)",
            "access the phishing URLs, false positives are considered to [6] NingxiaZhang,YongqingYuan,PhishingDetectionUsingNeuralNet-",
            "work,InProceedingsofInternationalConferenceonNeuralInformation",
            "be important while deciding the best classifier. The Figure 4",
            "Processing,pp.714–719.Springer,Heidelberg(2004)",
            "showsthefalsepositiveratesofalltheclassifiers.Itisevident",
            "[7] RamBasnet,SrinivasMukkamalaetal,DetectionofPhishingAttacks:A",
            "that SVM has the least False positive rate among the three.",
            "MachineLearningApproach,InProceedingsoftheInternationalWorld",
            "Hence,SVMworksbestinclassifyingthephishingURLfrom WideWebConference(WWW),2003",
            "the legitimate URLs.",
            "[8] Sci-kit learn, SVM library. Available: http://scikit-",
            "learn.org/stable/modules/svm.html",
            "VIII. CONCLUSION [9] Sklearn, ANN library. Available: http://scikit-",
            "learn.org/stable/modules/ann.html",
            "Thus to summarize, we have seen how phishing is a huge",
            "[10] Sklearn, Random foresets library. Available: http://scikit-",
            "threat to the security and safety of the web and how phishing learn.org/stable/modules/Randomforesets.html"
        ]
    },
    {
        "page": 7,
        "content": [
            "[11] Lichman, M. (2013). UCI Machine Learning Repository, University",
            "of California, Irvine, School of Information and Computer Sciences.",
            "Available:http://archive.ics.uci.edu/ml"
        ]
    }
]